app/Controllers/AddDesenhoPost.php

      // Cria uma instância do modelo de Desenhos_temp.
      $db = new \App\Models\Desenhos_temp();

      // Insere os dados do diretório temporário no banco de dados.
      $db->insert($data);
---
INSERT INTO `desenhos_temp` (`diretorio`, `individuo`, `data_add`, `status`) VALUES ('Ci083ni061nwli061ntempi061n58290i061n', '35', '18i061n02i061n2025 13i083n34i083n56', 'processando')