app/Controllers/DesenhosCortadosPost.php

SELECT *
FROM `recolocar_desenho`
WHERE `desenho` = '0'
---
  function recolocar_desenho()
  {
    session_start();
    $id = service('request')->getPost('id');
    $status = service('request')->getPost('status');

    $Recolocar_desenho = new \App\Models\Recolocar_desenho();

    $data_recolocar = $Recolocar_desenho->where('desenho',  $_SESSION["lista_recolocar"][$id])
      ->find();