app/Controllers/DesenhoPost.php

  function desenho_update()
  {
    if ($this->request->isAJAX()) {
      // Inicializa a sessão para acessar os dados da lista armazenados nela
      session_start();


      // Obtém o array de IDs e a nova prioridade da solicitação
      $array = service('request')->getPost('array');
      $prioridade_nova = service('request')->getPost('prioridade');
      $ordem = service('request')->getPost('ordem');

      $ok = false; // Variável para indicar se a operação foi bem-sucedida
      $violacao = array(); // Array para armazenar informações de violações

      if ($prioridade_nova != '') {
        // Se a nova prioridade não estiver vazia, prossiga com a atualização
        $prioridade = new \App\Models\Prioridade(); // Obtém a tabela de prioridades do banco
        $ok = true; // Define que a operação está OK

        $prioridade_data = $prioridade->find();
---
SELECT *
FROM `prioridade`

            "prioridade" => $id_prio

          ];
          $desenhos->update($ids, $data);
---
UPDATE `desenhos` SET `prioridade` = '1'
WHERE `desenhos`.`id` IN ('22835')

  function desenho_modal()
  {
    if ($this->request->isAJAX()) {
      // Inicializa a sessão para acessar os dados da lista armazenados nela
      session_start();
      $id = service('request')->getPost('id');

      $db = new \App\Models\Desenhos();
      $desenhos_data = $db
        ->whereIn('status', [
          Ferramentas::codificador('pendente'),
          Ferramentas::codificador('cortando')
        ])
        ->find();
---
SELECT *
FROM `desenhos`
WHERE `status` IN ('pendente','cortando')