app/Controllers/DesenhosMeusPost.php

  function desenho_meus()
  {
    if ($this->request->isAJAX()) {
      // Inicializa a sessão para acessar os dados da lista armazenados nela
      session_start();
      $caminho = "";
      // Instancia tabelas do banco de dados
      $desenhos = new \App\Models\Desenhos();
      $prioridade = new \App\Models\Prioridade();
      $finalidade = new \App\Models\Finalidade();
      $empresa = new \App\Models\Empresa();
      $empreendimento = new \App\Models\Empreendimentos();
      $processos = new \App\Models\Processos();

      // Recupera dados das tabelas do banco de dados
      $prioridade_data = $prioridade->find();
      $finalidade_data = $finalidade->find();
      $empresa_data = $empresa->find();
      $empreendimento_data = $empreendimento->find();
      $desenhos_data = $desenhos->find();
      $processos_data = $processos->find();
---
SELECT *
FROM `prioridade`
SELECT *
FROM `finalidade`
SELECT *
FROM `empresa`
SELECT *
FROM `empreendimentos`
SELECT *
FROM `desenhos`
SELECT *
FROM `processos`