app/Controllers/EmpreendimentoPost.php

  function empreendimento_lista()
  {
    if ($this->request->isAJAX()) {
      session_start();
      $empreendimento = new \App\Models\Empreendimentos(); //pega do banco a tabela
      $empresa = new \App\Models\Empresa();
      $empresa_data = $empresa->find();
      $empresa_usando = service('request')->getPost('empresa');
      $id = Ferramentas::array_index(Ferramentas::array_pesquisa($empresa_data, 'nome', Ferramentas::codificador($empresa_usando)), ['id']);
      $empreendimento_data = $empreendimento->find();
---
SELECT *
FROM `empresa`
SELECT *
FROM `empreendimentos`