app/Controllers/EmpresaPost.php

  function empresa_lista() //rece um post via ajax pedindo para listar os usuarios
  {
    if ($this->request->isAJAX()) {
      session_start();
      $finalidade = new \App\Models\Empresa(); //pega do banco a tabela

      $finalidade_data = $finalidade->find();
---
SELECT *
FROM `empresa`