app/Controllers/Ferramentas.php

    function re_ordenar_oredem_desenho($id = null, $prioridade_id = null, $ordem = null)
    {
        // Instância do Model de Desenhos (ajuste o namespace conforme sua aplicação)
        $db = new \App\Models\Desenhos();

        // Busca os desenhos conforme o status e, se informado, a prioridade
        if ($prioridade_id != null) {

            $desenhos_data = $db
                ->whereIn('status', [
                    Ferramentas::codificador('pendente'),
                    Ferramentas::codificador('cortando')
                ])
                ->where("prioridade", $prioridade_id)
                ->find();
        } else {
            $desenhos_data = $db
                ->whereIn('status', [
                    Ferramentas::codificador('pendente'),
                    Ferramentas::codificador('cortando')
                ])
                ->find();
---
SELECT *
FROM `desenhos`
WHERE `status` IN ('pendente','cortando')
AND `prioridade` = '1'
SELECT *
FROM `desenhos`
WHERE `status` IN ('pendente','cortando')