app/Controllers/FinalidadePost.php

  function finalidade_lista()
  {
    if ($this->request->isAJAX()) {
      session_start();
      $finalidade = new \App\Models\Finalidade(); //pega do banco a tabela

      $finalidade_data = $finalidade->find();
---
SELECT *
FROM `finalidade`