app/Controllers/ListaCortePost.php

SELECT *
FROM `prioridade`
SELECT *
FROM `finalidade`
SELECT *
FROM `empresa`
SELECT *
FROM `empreendimentos`
SELECT *
FROM `desenhos`
SELECT *
FROM `usuarios`
SELECT *
FROM `corte`
SELECT *
FROM `processos`
---
    function lista_corte_adm() //rece um post via ajax pedindo para listar os usuarios
    {
        if ($this->request->isAJAX()) {
            Ferramentas::re_ordenar_oredem_desenho();
            session_start();
            // Inicialização de objetos para acessar tabelas do banco de dados
            $desenhos = new \App\Models\Desenhos();
            $prioridade = new \App\Models\Prioridade();
            $finalidade = new \App\Models\Finalidade();
            $empresa = new \App\Models\Empresa();
            $empreendimento = new \App\Models\Empreendimentos();
            $usuario = new \App\Models\Usuarios();
            $cortado = new \App\Models\Corte();
            $processos = new \App\Models\Processos();


            // Recupera dados das tabelas do banco de dados
            $prioridade_data = $prioridade->find();
            $finalidade_data = $finalidade->find();
            $empresa_data = $empresa->find();
            $empreendimento_data = $empreendimento->find();
            $desenhos_data = $desenhos->find();
            $usuario_data = $usuario->find();
            $cortado_data = $cortado->find();
            $processos_data = $processos->find();

SELECT *
FROM `alteracoes`
WHERE `item` = 'som_corte'
ORDER BY `id` DESC
 LIMIT 1
---
            $lista_ids = array();
            $lista_completa = array();
            $alteracao = new \App\Models\Alteracoes();
            $alteracao_data = $alteracao->where('item', 'som_corte')
                ->orderBy('id', 'DESC')
                ->first();

SELECT *
FROM `desenhos`
---
    function confirmar_corte()
    {
        if ($this->request->isAJAX()) {
            session_start();
            // $_SESSION['confirmar_corte_proc'] = isset ($_SESSION['confirmar_corte_proc']) ? $_SESSION['confirmar_corte_proc'] : FALSE;
            // if ($_SESSION['confirmar_corte_proc']) {
            //     return;
            //   } else {
            //     $_SESSION['confirmar_corte_proc'] = TRUE;
            //   }
            // Obtém o ID do desenho a ser cortado a partir dos dados da requisição AJAX
            $id = service('request')->getPost('id');
            $id = $_SESSION["lista"][$id];
            $data = [];
            $desenho = new \App\Models\Desenhos();

            // Busca os dados do desenho no banco de dados
            $desenho_data = $desenho->find();

SELECT *
FROM `corte`
---

                // Atualiza os registros no banco de dados
                $corte = new \App\Models\Corte();
                $corte_data = $corte->find();

INSERT INTO `corte` (`cortador_fim`, `data_fim`, `status`, `id_desenho`, `cortador`, `data_add`, `ip`) VALUES ('3', '24i061n02i061n2025 11i083n44i083n11', 'finalizado', '22686', '3', '24i061n02i061n2025 11i083n44i083n11', '192i062n168i062n0i062n115')
---
                        'ip' => Ferramentas::codificador($_SERVER['REMOTE_ADDR']),

                    ]);
                    $corte->insert($insert_data);

UPDATE `desenhos` SET `cortador` = '3', `status` = 'cortado', `nome` = 'cortadoi074n24i074n02i074n2025i074nCADEIRAi074nACRILICOi074nBEGEi074nESCUROi074n1MMi074n5236i074ni062ndxf', `caminho` = 'ci083ni061nwli061nCORTEi074nLASERi061nTESTEi061nTESTEi061nMOBILIARIOi074ni061nTESTE2i061ncortadoi074n24i074n02i074n2025i074nCADEIRAi074nACRILICOi074nBEGEi074nESCUROi074n1MMi074n5236i074ni062ndxf'
WHERE `desenhos`.`id` IN ('22686')
---
                    'caminho' => Ferramentas::codificador($caminho . $novo_nome)

                ];
                $desenho->update($id, $updat);

SELECT *
FROM `prioridade`
SELECT *
FROM `desenhos`
---
    function atualiza_prio()
    {
        // Inicialização de modelos de banco de dados
        $desenhos = new \App\Models\Desenhos();
        $prioridade = new \App\Models\Prioridade();
        $lista_temp = new \App\Models\Historico_desenhos;

        // Obtém dados relevantes
        $lista_temp_data = $lista_temp->find();
        $prioridade_data = $prioridade->find();
        $desenhos_data = $desenhos->find();

UPDATE `desenhos` SET `prioridade` = '1'
WHERE `desenhos`.`id` IN ('20724')
---
                            $updat = [
                                'prioridade' => Ferramentas::array_pesquisa($prioridade_data, 'ordem', '1')['id']
                            ];
                            $desenhos->update($value['id'], $updat);

SELECT *
FROM `prioridade`
SELECT *
FROM `finalidade`
SELECT *
FROM `empresa`
SELECT *
FROM `empreendimentos`
SELECT *
FROM `corte`
SELECT *
FROM `usuarios`
SELECT *
FROM `processos`
---
    function lista_tarefas()
    {
        // Verifica se a solicitação é uma chamada AJAX
        if (true) {
            Ferramentas::re_ordenar_oredem_desenho();
            $status = "pendente";
            $processo = service('request')->getPost('processo');

            // Atualiza a prioridade dos desenhos com base em critérios específicos.
            $oi = self::atualiza_prio();

            // Inicializa modelos de banco de dados
            $desenhos      = new \App\Models\Desenhos();
            $prioridade    = new \App\Models\Prioridade();
            $finalidade    = new \App\Models\Finalidade();
            $empresa       = new \App\Models\Empresa();
            $empreendimento = new \App\Models\Empreendimentos();
            $corte         = new \App\Models\Corte();
            $usuario       = new \App\Models\Usuarios();
            $processos     = new \App\Models\Processos();

            // Obtém dados de outros modelos (essas buscas podem permanecer como estão)
            $prioridade_data   = $prioridade->find();
            $finalidade_data   = $finalidade->find();
            $empresa_data      = $empresa->find();
            $empreendimento_data = $empreendimento->find();
            $corte_data        = $corte->find();
            $usuario_data      = $usuario->find();
            $processos_data    = $processos->find();

SELECT *
FROM `alteracoes`
WHERE `item` = 'som_corte'
ORDER BY `id` DESC
 LIMIT 1
---
            $_SESSION["lista_completa"] = $lista_completa;

            $alteracao = new \App\Models\Alteracoes();
            $alteracao_data = $alteracao->where('item', 'som_corte')
                ->orderBy('id', 'DESC')
                ->first();