app/Controllers/Login.php

    function login()
    {

        // Verifica se a requisição é AJAX.
        if ($this->request->isAJAX()) {

            // Obtém os valores de nome e senha do POST da requisição.
            $nome = service('request')->getPost('nome');
            $senha = service('request')->getPost('senha');

            // Codifica os valores de nome e senha utilizando a função de codificação Ferramentas::codificador.
            $nome = Ferramentas::codificador($nome);
            $senha = Ferramentas::codificador($senha);

            // Cria uma instância do modelo de Usuários.
            $db = new \App\Models\Usuarios();

            // Realiza uma consulta no banco de dados para encontrar dados do usuário.
            $db_data = $db->find();
---
SELECT *
FROM `usuarios`

  function login_verificar_permissao(){

        // Verifica se a requisição é AJAX.
        if ($this->request->isAJAX()) {

            // Obtém os valores de nome e senha do POST da requisição.
            $nome = service('request')->getPost('nome');
            $senha = service('request')->getPost('senha');

            // Codifica os valores de nome e senha utilizando a função de codificação Ferramentas::codificador.
            $nome = Ferramentas::codificador($nome);
            $senha = Ferramentas::codificador($senha);

            // Cria uma instância do modelo de Usuários.
            $db = new \App\Models\Usuarios();

            // Realiza uma consulta no banco de dados para encontrar dados do usuário.
            $db_data = $db->find();
---
SELECT *
FROM `usuarios`

                    // Cria uma instância do modelo de Função.
                    $db = new \App\Models\Nivel();

                    // Realiza uma consulta no banco de dados para encontrar dados de funções.
                    $db_data = $db->find();
---
SELECT *
FROM `nivel`