app/Controllers/NivelPost.php

SELECT *
FROM `nivel`
---
  function nivel_lista()
  {
    if ($this->request->isAJAX()) {
      $ativo = service('request')->getPost('ativos');
      $desativado = service('request')->getPost('desativados');


      session_start();

      $id_temp = -1;

      $db_nivel = new \App\Models\Nivel();

      $nivel_data = $db_nivel->find();