app/Controllers/PrioridadePost.php

SELECT *
FROM `prioridade`
---
  function prioridade_lista()
  {
    if ($this->request->isAJAX()) {
      // Inicializa a sessão para acessar os dados da lista armazenados nela
      session_start();

      $prioridade = new \App\Models\Prioridade(); // Obtém a tabela de prioridades do banco

      $prioridade_data = $prioridade->find();