app/Controllers/ProcessosPost.php

SELECT *
FROM `processos`
---
  function processos_lista()
  {
    if ($this->request->isAJAX()) {
      // Inicializa a sessão para acessar os dados da lista armazenados nela
      session_start();

      $processos = new \App\Models\Processos(); // Obtém a tabela de prioridades do banco

      $processos_data = $processos->find();