app/Controllers/ProcessosPost.php

SELECT *
FROM `filtros`
---
  function processos_modifica_modal()
  {
    if ($this->request->isAJAX()) {
      $id = service('request')->getPost('id');
      session_start();

      $filtro_db = new \App\Models\Filtros(); // Obtém a tabela de prioridades do banco

      $filtro_data = $filtro_db->find();